{
"intents": [
{
"tag":"saluti",
"patterns":["ciao","buongiorno","hey","salve","hey, ciao"],
"responses": ["Ciao!","Hey!"]
},
  {
"tag":"bene",
"patterns":["bene","male","abbastanza bene","abbastanza bene","vado avanti","si tira avanti"],
"responses": ["come posso aiutarti?","posso aiutarti in qualche modo?","ti posso essere utile?","hai bisogno di qualcosa riguardante l'app?"]
},
{
"tag":"domandeCortesia",
"patterns":["come stai","come te la passi","tutto bene","come sta andando la giornata"],
"responses": ["Bene e tu?","Alla grande!"]
},
{
"tag": "punti",
"patterns": ["come funzionano i punti","che cosa sono i punti","spiegami i punti","come faccio a guadagnare punti"],
"responses": ["I punti, chiamati 'cornicoin', permettono di riscattare dei premi al raggiungimento di una soglia. Ogni acquisto all'interno di un negozio associato garantisce una corrispondenza in punti. Ogni euro di spesa equivale ad un cornicoin. "]
},
  {
"tag": "premi",
"patterns": ["quali premi posso riscattare","cosa posso ottenere con i punti","a cosa posso accedere con i cornicoin","quali sono i premi disponibili"],
"responses": ["I premi disponibili per il riscatto sono stati realizzati dalla scuola media Alessandro Volta di Genova Cornigliano. Alcuni esempi di premi sono gadget personalizzati, buoni sconto per negozi associati e ingressi gratuiti a eventi locali."]
},
{
"tag": "raggiungimento soglia",
"patterns": ["quanti punti servono per riscattare un premio","come faccio a sapere quando ho raggiunto la soglia per il riscatto","qual è la soglia per il riscatto dei premi"],
"responses": ["La soglia per il riscatto dei premi varia in base al premio scelto. Una volta che hai raggiunto la soglia necessaria, potrai riscattare il premio tramite l'app."]
},
{
"tag": "che cos'è",
"patterns": ["che cos'è questa app","a cosa serve questa app","qual è lo scopo di questa app?","come funziona","come funziona questa app","che scopo ha","parlami dell'app","spiegami a cosa serve l'app"],
"responses": ["Questa app serve per guadagnare punti e riscattare premi. È stata sviluppata per promuovere le piccole aziende di Cornigliano."]
},
{
"tag": "creazione",
"patterns": ["chi ha progettato l'app","chi l'ha inventata","chi l'ha creata"],
"responses": ["L'applicazione è stata progettata dalle classi del triennio dell' Istituto Tecnico Calvino di Genova Sestri Ponente e dalle classi terze dell' Istituto Volta di Genova Cornigliano."]
},
{
"tag": "registrazione",
"patterns": ["come faccio a registrarmi","devo registrarmi per usare l'app","quali sono i requisiti per registrarsi","cosa devo fare per registrarmi","ho problemi con la registrazione"],
"responses": ["Per registrarti, devi aprire l'applicazione da cellulare, inserire la tua email e password personali e cliccare sul pulsante rotondo verde in basso al centro. In seguito, dovrai inserire l'importo dell'acquisto effettuato in uno dei negozi associati e far scannerizzare il codice QR al negoziante per ricevere i tuoi punti. Se hai problemi con la registrazione, ti consigliamo di contattare il supporto tecnico."]
},
{
  "tag": "funzionamento",
  "patterns": ["come funziona l'app","come si usa l'app","quali sono i passaggi per utilizzare l'app"],
  "responses": ["Per utilizzare l'app, è sufficiente aprire l'applicazione da cellulare, registrarsi con email e password personali e cliccare sul pulsante rotondo verde in basso al centro. Dopo aver cliccato, devi inserire l'importo in euro e fare scannerizzare il codice QR al negoziante. Il gioco è fatto! Riceverai i tuoi punti."]
},
{
  "tag": "negozi",
  "patterns": ["quali sono i negozi associati","in quali negozi posso utilizzare l'app","dove posso utilizzare l'app"],
  "responses": ["L'applicazione serve per promuovere le piccole attività alimentari di Genova Cornigliano. Puoi utilizzarla presso i negozi associati situati in Cornigliano."]
},
{
  "tag": "premi",
  "patterns": ["quali sono i premi disponibili","cosa posso riscattare con i punti","che premi posso ottenere"],
  "responses": ["I premi disponibili per il riscatto sono stati realizzati dalla scuola media Alessandro Volta di Genova Cornigliano. Per maggiori informazioni sui premi disponibili e sulle soglie di riscatto, ti consigliamo di contattare direttamente la scuola."]
},
{
  "tag": "contatti",
  "patterns": ["come posso contattare l'assistenza","ho bisogno di aiuto","chi posso contattare in caso di problemi","dove posso trovare supporto"],
  "responses": ["Per qualsiasi problema o dubbio sull'utilizzo dell'app, puoi contattare l'assistenza attraverso l'indirizzo email: assistenza@cornigliapp.it."]
},
{
  "tag": "ringraziamenti",
  "patterns": ["grazie","grazie mille","ti ringrazio","è stato utile","ottimo servizio"],
  "responses": ["Grazie a te! Siamo felici di esserti stati utili e di averti fornito tutte le informazioni di cui avevi bisogno."]
},
  {
    "tag": "impostazioni",
    "patterns": ["dove si trovano le impostazioni","impostazioni","come accedo alle impostazioni","come modifco i miei dati"],
    "responses": ["nella schermata home, in alto a destra c'è una rotellina, cliccandoci sopra si apre una pagina impostazioni dove è possibile modificare i propri dati, cambiare il colore dell'app e disconnettersi"]
  }
  ]}